paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_aoc_101_drv.c
			| P2MDIN_B3__DIGITAL    //set p2.3 is used for rx cdr interrupt input

			| P2MDIN_B4__DIGITAL 	//not used

			| P2MDIN_B5__ANALOG 	//set p2.5 analog mode is used for RSSI

			| P2MDIN_B6__DIGITAL ;  //not used

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).

	P2MDOUT = P2MDOUT_B0__OPEN_DRAIN | P2MDOUT_B1__OPEN_DRAIN //set p2.0 and p2.1 open drain mode are used for i2c slave mode

			| P2MDOUT_B2__OPEN_DRAIN   //not used

			| P2MDOUT_B3__OPEN_DRAIN    //because p1.5 is input pin,so set p1.5 default value(open drain mode) is used for rx cdr interrupt input

			| P2MDOUT_B4__OPEN_DRAIN   //not used

			| P2MDOUT_B5__OPEN_DRAIN   //because the p2.5 is set analog mode闂佹寧绋戦鎶�this bit can be not set is used for RSSI

			| P2MDOUT_B6__OPEN_DRAIN;  //not used

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P2SKIP = P2SKIP_B0__SKIPPED | P2SKIP_B1__SKIPPED   		//set p2.0 and p2.1 skipped for i2c slave mode
			| P2SKIP_B2__NOT_SKIPPED
			| P2SKIP_B3__SKIPPED		//p2.3 must be skipped is uesed to rx interrupt for port match

			//because p2.5 is set analog mode ,so this bit must be skipped is used for for RSSI
			| 0x20;

	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED

			//p2.3 must be compared is uesed to rx interrupt for port match
			| P2MASK_B3__COMPARED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;

	SFRPAGE = SFRPAGE_SAVE;
}

static void _aoc_101_port3_init_for_am3()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
	P3 = P3_B0__HIGH | P3_B1__HIGH | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0  is used for lpmode pin

			| P3MDIN_B1__DIGITAL   //not used

			| P3MDIN_B2__DIGITAL   //set p3.2  is used for modsel pin

			| P3MDIN_B3__DIGITAL   //not used

			| P3MDIN_B4__DIGITAL;  //not used

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__OPEN_DRAIN   //because p3.0 is input pin,so set p3.0 default value(open drain mode) is used for lpmode pin

			| P3MDOUT_B1__OPEN_DRAIN   //because p3.4 is not used,so set p3.4 default value(open drain mode)

			| P3MDOUT_B2__OPEN_DRAIN   //because the p3.2 and uart pin multiplexing,so this pin must be open drain when use uart

			| P3MDOUT_B3__OPEN_DRAIN   //because p3.3 is not used,so set p3.4 default value(open drain mode)

			| P3MDOUT_B4__OPEN_DRAIN;  //because p3.4 is not used,so set p3.4 default value(open drain mode)

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).

	//p3 do't have p3SKIP registers

	//5. set p2MASK
	//p3 do't have P3MASK registers

	//6. set P2MAT
	//p3 do't have P3MAT registers
	SFRPAGE = SFRPAGE_SAVE;
}
#endif

#ifdef HW_VER_AM4_101
static void _aoc_101_port0_init_for_am4()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x0;
	//1.set port default value
	P0 = P0_B0__HIGH | P0_B1__HIGH | P0_B2__HIGH | P0_B3__HIGH | P0_B4__HIGH | P0_B5__HIGH | P0_B6__HIGH | P0_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P0MDIN =  P0MDIN_B0__DIGITAL   					    //not used
			| P0MDIN_B1__DIGITAL 						//set p0.1 is used for lpmode pin
			| P0MDIN_B2__DIGITAL                        //set p0.2 is used for reset mcu
			| P0MDIN_B3__DIGITAL						//not used
			| P0MDIN_B4__DIGITAL | P0MDIN_B5__DIGITAL   //set p0.4 and p0.5 digital mode is used for uart0
			| P0MDIN_B6__DIGITAL 					    //set p0.6 is used for rx interrupt pin
			| P0MDIN_B7__DIGITAL;					    //set p0.7 is used for tx interrupt pin


	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P0MDOUT = P0MDOUT_B0__OPEN_DRAIN    					    //not used
			| P0MDOUT_B1__OPEN_DRAIN 							//set p0.1 is used for lpmode pin
			| P0MDOUT_B2__OPEN_DRAIN							//set p0.2 is used for reset mcu
			| P0MDOUT_B3__OPEN_DRAIN	    					//not used
			| P0MDOUT_B4__OPEN_DRAIN | P0MDOUT_B5__OPEN_DRAIN   //set p0.4 push pull and p0.5 open drain is uesd for uart0
			| P0MDOUT_B6__OPEN_DRAIN							//set p0.6 is used for rx interrupt pin
			| P0MDOUT_B7__OPEN_DRAIN;						    //set p0.7 is used for tx interrupt pin


	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P0SKIP = P0SKIP_B0__SKIPPED					//because P1.2 and p1.3 are used to Smbus,so P0.0 ~ P0.7 must be skipped
			| P0SKIP_B1__SKIPPED| P0SKIP_B2__SKIPPED   //not used
			| P0SKIP_B3__SKIPPED					   //not used
			| P0SKIP_B4__SKIPPED | P0SKIP_B5__SKIPPED
			| P0SKIP_B6__SKIPPED 				//not used
			| P0SKIP_B7__SKIPPED;

	//5. set p0MASK
	P0MASK = P0MASK_B0__IGNORED | P0MASK_B1__IGNORED | P0MASK_B2__IGNORED
			| P0MASK_B3__IGNORED | P0MASK_B4__IGNORED | P0MASK_B5__IGNORED
			| P0MASK_B6__COMPARED | P0MASK_B7__COMPARED;

	//6. set P0MAT
	P0MAT = P0MAT_B0__HIGH | P0MAT_B1__HIGH | P0MAT_B2__HIGH | P0MAT_B3__HIGH
			| P0MAT_B4__HIGH | P0MAT_B5__HIGH | P0MAT_B6__HIGH | P0MAT_B7__HIGH;

	SFRPAGE = SFRPAGE_SAVE;

}

static void _aoc_101_port1_init_for_am4()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x0;
	//1.set port default value
	P1 = P1_B0__HIGH | P1_B1__LOW | P1_B2__HIGH | P1_B3__HIGH | P1_B4__HIGH | P1_B5__HIGH | P1_B6__HIGH | P1_B7__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P1MDIN =  P1MDIN_B0__DIGITAL  					   //set p1.0 is used for modsel pin
			| P1MDIN_B1__DIGITAL 					   //set p1.1 is used for tx_dis pin
			| P1MDIN_B2__DIGITAL | P1MDIN_B3__DIGITAL  //set p1.2 and p1.3 digital mode is used for i2c master mode

			| P1MDIN_B4__DIGITAL     			  //not used
			| P1MDIN_B5__DIGITAL				  //not used
			| P1MDIN_B6__DIGITAL    			  //not used
			| P1MDIN_B7__ANALOG;                  //set p1.7 analog mode is used for 3v3mon

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P1MDOUT = P1MDOUT_B0__OPEN_DRAIN    			  			//set p1.0 is used for modsel pin
			| P1MDOUT_B1__PUSH_PULL					  			//set p1.1 is used for tx_dis pin
			| P1MDOUT_B2__OPEN_DRAIN | P1MDOUT_B3__OPEN_DRAIN	//because p1.2 and p1.3 are used for i2c master mode,so the two bits must be open drain

