paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_aoc_101_drv.c
			| P1MDOUT_B4__OPEN_DRAIN            //not used
			| P1MDOUT_B5__OPEN_DRAIN			//not used
			| P1MDOUT_B6__OPEN_DRAIN			//not used
			| P1MDOUT_B7__OPEN_DRAIN;           //set p1.7 analog mode is used for 3v3mon

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P1SKIP = P1SKIP_B0__SKIPPED 			//because p1.0 is set analog mode and p1.2 and p1.3 are used to Smbus ,so this bit must be skipped are used for mointor the 3.3V module input voltage
			| P1SKIP_B1__SKIPPED			//set p1.1 skip in order to p1.2 and p1.3 are used for i2c master mode
			| P1SKIP_B2__NOT_SKIPPED | P1SKIP_B3__NOT_SKIPPED

			//because P2.0 and p2.1 are used for i2c slave mode,so P1.0 ~ P1.7 must be skipped,p1.5 must be skipped is uesed to tx interrupt for port match
			| P1SKIP_B4__SKIPPED | P1SKIP_B5__SKIPPED| P1SKIP_B6__SKIPPED | P1SKIP_B7__SKIPPED;

	//5. set p1MASK
	P1MASK = P1MASK_B0__COMPARED  //p1.0 must be compared is uesed to modsel for port match
			| P1MASK_B1__IGNORED | P1MASK_B2__IGNORED
			| P1MASK_B3__IGNORED | P1MASK_B4__IGNORED | P1MASK_B5__IGNORED
			| P1MASK_B6__IGNORED | P1MASK_B7__IGNORED;

	//6. set P1MAT
	P1MAT = P1MAT_B0__HIGH | P1MAT_B1__HIGH | P1MAT_B2__HIGH | P1MAT_B3__HIGH
			| P1MAT_B4__HIGH | P1MAT_B5__HIGH | P1MAT_B6__HIGH | P1MAT_B7__HIGH;

	SFRPAGE = SFRPAGE_SAVE;
}


static void _aoc_101_port2_init_for_am4()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
	P2 = P2_B0__HIGH | P2_B1__HIGH | P2_B2__HIGH | P2_B3__HIGH | P2_B4__HIGH | P2_B5__HIGH | P2_B6__HIGH ;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P2MDIN = P2MDIN_B0__DIGITAL | P2MDIN_B1__DIGITAL	 //set p2.0 and p2.1 digital mode are used for i2c slave pin

			| P2MDIN_B2__ANALOG     //set p2.2 analog mode is used for mpd3

			| P2MDIN_B3__ANALOG     //set p2.3 analog mode is used for mpd2

			| P2MDIN_B4__ANALOG 	//set p2.4 analog mode is used for mpd1

			| P2MDIN_B5__ANALOG 	//set p2.5 analog mode is used for mpd0

			| P2MDIN_B6__ANALOG ;   //set p2.6 analog mode is used for RSSI

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).

	P2MDOUT = P2MDOUT_B0__OPEN_DRAIN | P2MDOUT_B1__OPEN_DRAIN //set p2.0 and p2.1 open drain mode are used for i2c slave mode

			| P2MDOUT_B2__OPEN_DRAIN   //set p2.2 analog mode is used for mpd3

			| P2MDOUT_B3__OPEN_DRAIN   //set p2.3 analog mode is used for mpd2

			| P2MDOUT_B4__OPEN_DRAIN   //set p2.4 analog mode is used for mpd1

			| P2MDOUT_B5__OPEN_DRAIN   //set p2.5 analog mode is used for mpd0

			| P2MDOUT_B6__OPEN_DRAIN;  //set p2.6 analog mode is used for RSSI

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P2SKIP = P2SKIP_B0__SKIPPED | P2SKIP_B1__SKIPPED   		//set p2.0 and p2.1 skipped for i2c slave mode
			| P2SKIP_B2__NOT_SKIPPED
			| P2SKIP_B3__SKIPPED		//p2.3 must be skipped is uesed to rx interrupt for port match

			//because p2.5 is set analog mode ,so this bit must be skipped is used for for RSSI
			| 0x20;

	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED

			//p2.3 must be compared is uesed to rx interrupt for port match
			| P2MASK_B3__IGNORED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;

	SFRPAGE = SFRPAGE_SAVE;
}


static void _aoc_101_port3_init_for_am4()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
	P3 = P3_B0__HIGH | P3_B1__HIGH | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0 digital mode is used for intl pin

			| P3MDIN_B1__DIGITAL   //set p3.1 digital mode is used for 3v3_en pin

			| P3MDIN_B2__DIGITAL   //not used

			| P3MDIN_B3__DIGITAL   //not used

			| P3MDIN_B4__DIGITAL;  //not used

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__OPEN_DRAIN   //set p3.0 is used for intl pin

			| P3MDOUT_B1__PUSH_PULL    //set p3.1 is used for 3v3_en pin

			| P3MDOUT_B2__OPEN_DRAIN   //because p3.2 is not used,so set p3.2 default value(open drain mode)

			| P3MDOUT_B3__OPEN_DRAIN   //because p3.3 is not used,so set p3.3 default value(open drain mode)

			| P3MDOUT_B4__OPEN_DRAIN;  //because p3.4 is not used,so set p3.4 default value(open drain mode)

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).

	//p3 do't have p3SKIP registers

	//5. set p2MASK
	//p3 do't have P3MASK registers

	//6. set P2MAT
	//p3 do't have P3MAT registers
	SFRPAGE = SFRPAGE_SAVE;
}
#endif

static bool _aoc_101_txcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

	if(TX3V3_EN == 0x1)
	{
		MSA_p2_log("\r\ntxcdr is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == smb_read_byte(AOC_101_TXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\ntxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\ntxcdr smb read failed");
		}
		Hw_time5_delay_us(5000);
	}

	return false;
}

static uint8_t _aoc_101_txcdr_m37145_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if(TX3V3_EN || ((_i2c_dev_ready & TX_READY) == 0x0))  //if TX3V3_EN == 1,indicat low power, there is prohibited to access i2c master
	{
		return GOS_FAIL;
	}
	return smb_read_byte(AOC_101_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _aoc_101_txcdr_m37145_i2c_write_byte(uint8_t OffsetAddr, uint8_t Data)
{
	if(TX3V3_EN || ((_i2c_dev_ready & TX_READY) == 0x0))  //if TX3V3_EN == 1,indicat low power, there is prohibited to access i2c master
	{
		return GOS_FAIL;
	}
	return smb_write_byte(AOC_101_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static void _aoc_101_txcdr_m37145_reset()
{
	if(_aoc_101_txcdr_check_exist())
	{
		_i2c_dev_ready |= TX_READY;
	}

	_aoc_101_txcdr_m37145_i2c_write_byte(0x2, 0xaa); 	//txcdr reset
	Soft_timer_delay_ms(100);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x2, 0x00); 	//txcdr reset
}

static void _aoc_101_txcdr_m37145_init()
{
	_aoc_101_txcdr_m37145_i2c_write_byte(0x11, 0x0f);;
	_aoc_101_txcdr_m37145_i2c_write_byte(0x19, 0xff);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x1d, 0x7f);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x1e, 0x05);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x21, 0xff);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x25, 0x04);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x26, 0x04);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x27, 0x04);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x28, 0x04);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x29, 0x0f);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x41, 0x00);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x4e, 0x00);
}

