paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_aoc_101_drv.c
/***********************************************RXCDR OPS********************************************************/
static bool _aoc_101_rxcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

	if(TX3V3_EN == 0x1)
	{
		MSA_p2_log("\r\nrxcdr is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == smb_read_byte(AOC_101_RXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\nrxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\nrxcdr smb read failed");
		}
		Hw_time5_delay_us(5000);
	}

	return false;
}

static uint8_t _aoc_101_rxcdr_m37144_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if(TX3V3_EN || ((_i2c_dev_ready & RX_READY) == 0x0))  //if TX3V3_EN == 1,indicat low power, there is prohibited to access i2c master
	{
		return GOS_FAIL;
	}
	return smb_read_byte(AOC_101_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _aoc_101_rxcdr_m37144_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
	if(TX3V3_EN || ((_i2c_dev_ready & RX_READY) == 0x0))  //if LPMODE == 1,indicat low power, there is prohibited to access i2c master
	{
		return GOS_FAIL;
	}
	return smb_write_byte(AOC_101_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static void _aoc_101_rxcdr_m37144_reset()
{
	if(_aoc_101_rxcdr_check_exist())
	{
		_i2c_dev_ready |= RX_READY;
	}

	_aoc_101_rxcdr_m37144_i2c_write_byte(0x2, 0xaa); 	//rxcdr reset
	Soft_timer_delay_ms(100);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x2, 0x00); 	//rxcdr reset
}


static void _aoc_101_rxcdr_m37144_init()
{
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x03,0xf0);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x19,0xff);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x1b,0x03);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x23,0xf0);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x40,0xf0);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x42,0x1e);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x43,0x1e);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x44,0x1e);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x45,0x1e);
}

static uint16_t _aoc_101_get_bias_average_value()
{
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	uint8_t i = 0, value_h = 0, value_l = 0;

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_aoc_101_txcdr_m37145_i2c_read_byte(0x68, &value_h);
		_aoc_101_txcdr_m37145_i2c_read_byte(0x69, &value_l);
		buff16[i] = (value_h << 4) | (value_l & 0xF);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

/* Return in 0.1mA */
static uint16_t _aoc_101_get_ddm_bias(uint8_t channel)
{
	uint8_t  channel_reg[] = {0x80,0x90,0xA0,0xB0};
	uint8_t  value1 = 0, value2 = 0;
	uint16_t var2 = 0, var3 = 0, var1 = 1;
	float Ibias_ua = 0;

	_aoc_101_txcdr_m37145_i2c_write_byte(0x60,0x00);

	_aoc_101_txcdr_m37145_i2c_write_byte(0x90, channel_reg[channel]);

	_aoc_101_txcdr_m37145_i2c_write_byte(0x92, 0x4);
	Hw_time5_delay_us(5000);  //waiting adc transform finish
	var2 = _aoc_101_get_bias_average_value();

	_aoc_101_txcdr_m37145_i2c_write_byte(0x92, 0x8);
	Hw_time5_delay_us(5000);   //waiting adc transform finish
	var3 = _aoc_101_get_bias_average_value();

	Ibias_ua = (float)((var2 - var3) * var1 * 40.1);  // uA

	Ibias_ua = Ibias_ua / 100.0;

	return (uint16_t)(Ibias_ua);  // 0.1 mA
}

/* return in 0.1mA */
static uint16_t _aoc_101_get_ddm_mpd(uint8_t channel)
{
	return _aoc_101_get_ddm_bias(channel);
}

static uint16_t _aoc_101_get_rssi_average_value()
{
	uint8_t i = 0;
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		buff16[i] = ADC0_manual_poll(ADC0_RSSI0) * 0.1;   // uint:mv
		Hw_time5_delay_us(2000);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

/* return in 1uA */
static uint16_t _aoc_101_get_ddm_rssi(uint8_t channel)
{
	uint8_t value = 0;
	uint16_t rssi_mv = 0;

	channel = 3 - channel;  //rxcdr pin is inverted sequence with qsfp28 pin

	_aoc_101_rxcdr_m37144_i2c_read_byte(0x3, &value);

	value = SET_BIT(value, 6); //rssi enable

	if(channel == MSA_PWR_CHANNEL_1)
	{
		//bit4 = 0, bit5 = 0
		value = CLEAR_BIT(value, 4);
		value = CLEAR_BIT(value, 5);
	}
	else if(channel == MSA_PWR_CHANNEL_2)
	{
		//bit5 = 0, bit4 = 1
		value = SET_BIT(value, 4);
		value = CLEAR_BIT(value, 5);
	}
	else if(channel == MSA_PWR_CHANNEL_3)
	{
		//bit5 = 1, bit4 = 0
		value = CLEAR_BIT(value, 4);
		value = SET_BIT(value, 5);
	}
	else if(channel == MSA_PWR_CHANNEL_4)
	{
		//bit4 = 1, bit5 = 1
		value = SET_BIT(value, 4);
		value = SET_BIT(value, 5);
	}
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x3, value);

	rssi_mv = _aoc_101_get_rssi_average_value();

	return (uint16_t)((float)rssi_mv / (float)AOC_101_RSSI_SERIES_RES * 1000.00);  //uA
}


/************************************** DRV Interface API ************************************/

void AOC_101_chip_reset()
{
	_aoc_101_txcdr_m37145_reset();
	_aoc_101_rxcdr_m37144_reset();
}

void AOC_101_chip_init()
{
	AOC_101_chip_reset();
	_aoc_101_txcdr_m37145_init();
	_aoc_101_rxcdr_m37144_init();
}

void AOC_101_port_init()
{
#ifdef HW_VER_AM3_101
	_aoc_101_port0_init_for_am3();
	_aoc_101_port1_init_for_am3();
	_aoc_101_port2_init_for_am3();
	_aoc_101_port3_init_for_am3();
#endif

#ifdef HW_VER_AM4_101
	_aoc_101_port0_init_for_am4();
	_aoc_101_port1_init_for_am4();
	_aoc_101_port2_init_for_am4();
	_aoc_101_port3_init_for_am4();
#endif
}


void AOC_101_polling()
{
	ADC0_poll();
}

int16_t AOC_101_ddmi_get_temp(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return ((int16_t)((float)(ddmi_cali->temp) * Timer_temp_slow_boot_cal()) + ADC0_get_mcu_temp()); 		//MSA format uint: 1/256 C
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_mcu_temp();	//uint: 1/256 C
	}
	return GOS_FAIL;
}

/* return voltage in 0.1mV */
uint16_t AOC_101_ddmi_get_vcc(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();

		return (ddmi_cali->vcc + ADC0_get_vcc()); //uint:0.1mv
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_vcc();  //uint:0.1mv
	}
	return 0;
}

