paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_aoc_101_drv.c
/* Return bias in 0.1mA */
uint16_t AOC_101_ddmi_get_bias(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		uint16_t bias = 0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T	 *laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->bias uint:0.1mA
		bias  = (uint16_t)((ddmi_cali->current[channel].bias.bias_offset2 + laser_stat->ch[channel].stat.txbias) * 0.1 * 1000.0 * 0.5); //uint:2uA
		return  bias;  //uint:2uA
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)(_aoc_101_get_ddm_bias(channel));
	}
	return GOS_FAIL;
}

/* return power in 0.1uW or in 1uA */
uint16_t AOC_101_ddmi_get_rx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float rxpower_result = 0.0 ,rxpower1 = 0.0, rxpower2 = 0.0, rssi1 = 0.0, rssi2 = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		*laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rxpower1 uint:0.1uw
		rxpower1 = (float)ddmi_cali->current[channel].rxpower.rxpower1 * 0.1 / 1000.0;  //uint:mW
		rxpower2 = (float)ddmi_cali->current[channel].rxpower.rxpower2 * 0.1 / 1000.0;  //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rssi1 uint:uA
		rssi1 	 = (float)ddmi_cali->current[channel].rxpower.rssi1;
		rssi2 	 = (float)ddmi_cali->current[channel].rxpower.rssi2;

		if(rssi2 != rssi1)
		{
			  rxpower_result = rxpower1 + ((float)laser_stat->ch[channel].stat.rssi - rssi1) * ((rxpower2 - rxpower1) / (rssi2 - rssi1));  //uint: mW
		}

		CHECK_POWER_MIN(rxpower_result);
		CHECK_POWER_MAX(rxpower_result);
		return (uint16_t)(rxpower_result * 10.0 * 1000.0);  //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  (uint16_t)_aoc_101_get_ddm_rssi(channel);  //uint:uA
	}
	return GOS_FAIL;
}

/* return power in 0.1uW or in 0.1mA */
uint16_t AOC_101_ddmi_get_tx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float bias_rt_ma = 0.0, bias_ct_ma = 0.0, bias_N = 0.0;
		float txpower_result = 0.0, txpower1 = 0.0, txpower2 = 0.0, bias1 = 0.0, bias2 = 0.0;
		const DDMI_CALI_PARA_T    *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		  *laser_stat = MSA_p4_get_laser_state();
		const SFP_DRV_LASER_CFG_T *lo_cfg = (SFP_DRV_LASER_CFG_T *)MSA_p67_get_drv_lut();
		const SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);

		bias_rt_ma = 4.0 + 0.1 * (float)((m_cfg + channel)->bias);  					//bias dac value tranfer to bias current

		bias_ct_ma = 4.0 + 0.1 * (float)laser_stat->ch[channel].config.bias;    //bias dac value tranfer to bias current

		//laser_stat->ch[channel].stat.txpwr uint:0.1mA
		bias_N = bias_rt_ma - (bias_ct_ma - (float)laser_stat->ch[channel].stat.txpwr * 0.1);

		//ddmi_cali->tx_rx_pwr[channel].txpower.txpower uint:0.1uw
		txpower1 = (float)ddmi_cali->current[channel].txpower.txpower1 * 0.1 / 1000.0; //uint:mW
		txpower2 = (float)ddmi_cali->current[channel].txpower.txpower2 * 0.1 / 1000.0; //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].txpower.bias uint:0.1mA
		bias1 = (float)ddmi_cali->current[channel].txpower.bias1 * 0.1; //uint:mA
		bias2 = (float)ddmi_cali->current[channel].txpower.bias2 * 0.1; //uint:mA

		if(bias1 != bias2)
		{
			txpower_result = txpower1 + (txpower1 - txpower2)/(bias1 - bias2) * (bias_N - bias1);  //uint:mW
		}

		CHECK_POWER_MIN(txpower_result);
		CHECK_POWER_MAX(txpower_result);
		return (uint16_t)(txpower_result * 1000.0 * 10.0); //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (_aoc_101_get_ddm_mpd(channel)); // uint:0.1mA
	}
	return GOS_FAIL;
}

static uint8_t _aoc_101_crossing_value_handle(int16_t crossing)
{
	uint8_t value = 0;

	if(crossing >= 0x0 && crossing <= 7)
	{
		value = crossing;
	}
	else if(crossing > 7)
	{
		value = 7;  //max value
	}
	else if(crossing < -9)
	{
		value = 8;   //min value
	}
	//crossing     value
	//	 -8          8
	//	 -7          9
	//	 -6          10
	//	 -5          11
	//	 -4          12
	//	 -3          13
	//	 -2          14
	//	 -1          15
	else
	{
		value = crossing + 16;
	}
	return value;
}

static int8_t _aoc_101_crossing_dac_tranfer_cross_lut(uint8_t cross)
{
	uint8_t value = 0;

	if(cross >= 0x0 && cross <= 0x7)
	{
		value = cross;
	}
	else if(cross >= 0x8 && cross <= 0x15)
	{
		value = cross - 16;
	}
	//crossing     value
	//	 -8          8
	//	 -7          9
	//	 -6          10
	//	 -5          11
	//	 -4          12
	//	 -3          13
	//	 -2          14
	//	 -1          15
	return (int8_t)value;
}

static void  _aoc_101_sfp_drv_check_laser_ch(SFP_DRV_LASER_CFG_T *cfg)
{
	if(cfg->bias > 40)
	{
		cfg->bias = 40;
	}
	if(cfg->mod > 120)
	{
		cfg->mod = 120;
	}
}

void AOC_101_drv_adjust_laser_ch(uint8_t ch, SFP_DRV_LASER_CFG_T *cfg)
{
	static code uint8_t bias_reg[]  = {0x42,0x43,0x44,0x45};
	static code uint8_t mod_reg[]   = {0x46,0x47,0x48,0x49};
	static code uint8_t cross_reg[] = {0x4f,0x50,0x51,0x52};

	cfg->cross = _aoc_101_crossing_value_handle(cfg->cross);

	_aoc_101_txcdr_m37145_i2c_write_byte(bias_reg[ch], (uint8_t)cfg->bias);
	_aoc_101_txcdr_m37145_i2c_write_byte(mod_reg[ch], (uint8_t)cfg->mod);
	_aoc_101_txcdr_m37145_i2c_write_byte(cross_reg[ch], (uint8_t)cfg->cross);
}

void AOC_101_drv_get_laser_full_state(uint8_t channel, MSA_LUT_T *lut)
{
	static code uint8_t bias_reg[]  = {0x42,0x43,0x44,0x45};
	static code uint8_t mod_reg[]   = {0x46,0x47,0x48,0x49};
	static code uint8_t cross_reg[] = {0x4f,0x50,0x51,0x52};
	uint8_t bias, mod, cross;

	lut->temp = DDM_GET_TEMP(MSA_DRV_VAL_HW);

	_aoc_101_txcdr_m37145_i2c_read_byte(bias_reg[channel],  &bias);
	_aoc_101_txcdr_m37145_i2c_read_byte(mod_reg[channel],   &mod);
	_aoc_101_txcdr_m37145_i2c_read_byte(cross_reg[channel], &cross);

	lut->ch[channel].config.bias = (uint16_t)(bias & 0x7f);
	lut->ch[channel].config.mod  = (uint16_t)(mod & 0x7f);
	lut->ch[channel].config.cross = _aoc_101_crossing_dac_tranfer_cross_lut(cross);
}

