paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_aoc_101_drv.c
void AOC_101_drv_ch_calc_cfg (int16_t cur_temp, uint8_t ch, const SFP_DRV_LASER_CFG_T *lut, SFP_DRV_LASER_CFG_T *ret)
{
	SFP_DRV_LASER_CFG_T *lo_cfg = (lut + ch);
	SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);
	SFP_DRV_LASER_CFG_T *hi_cfg = (m_cfg + MSA_CHANNEL_NUM);

	ret->temp = cur_temp;

	ret->bias  = 40;
	ret->mod   = 80;
	ret->cross = 15;

	if(!MSA_p67_check_apc_lut_tab(lut))  //apc paramters is invalid, so there is no need to apc calibration
	{
		return;
	}

	if (cur_temp <= m_cfg->temp)
	{
		if((m_cfg->temp == lo_cfg->temp))
		{
			return;
		}

		ret->bias = (uint16_t )(floor(0.5 + (double)lo_cfg->bias +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->bias - lo_cfg->bias))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->mod = (uint16_t)(floor(0.5 + (double)lo_cfg->mod +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->mod - lo_cfg->mod))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->cross = (int16_t)(floor(0.5 + (double)lo_cfg->cross +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->cross - lo_cfg->cross))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
	}
	else
	{
		if((m_cfg->temp == hi_cfg->temp))
		{
			return;
		}

		ret->bias = (uint16_t)(floor(0.5 + (double)m_cfg->bias * exp(
						((double)(cur_temp - m_cfg->temp))
						* log(((double)hi_cfg->bias)/((double)m_cfg->bias))
						/ ((double)(hi_cfg->temp - m_cfg->temp)))));
		ret->mod  = (uint16_t)(floor(0.5 + (double)m_cfg->mod * exp(
						((double)(cur_temp-m_cfg->temp))
						* log(((double)hi_cfg->mod)/((double)m_cfg->mod))
						/ ((double)(hi_cfg->temp - m_cfg->temp)))));
		ret->cross = (int16_t)(floor(0.5 + (double)m_cfg->cross +
						((double)(cur_temp - m_cfg->temp)) * ((double)(hi_cfg->cross - m_cfg->cross))
						/ ((double)(hi_cfg->temp - m_cfg->temp))));
	}

	_aoc_101_sfp_drv_check_laser_ch(ret);
}

MSA_INTR_STATUS_T *AOC_101_get_drv_intr_status(uint8_t intr_mask)
{
	static MSA_INTR_STATUS_T status;
	uint8_t value = 0;

	if(intr_mask & PORT_INTR_TX_FAULT)
	{
		_aoc_101_txcdr_m37145_i2c_read_byte(0x18, &value);  //get tx fault
		status.tx_fault = (value & 0x0F);
	}

	if(intr_mask & PORT_INTR_TX_LOS)
	{
		_aoc_101_txcdr_m37145_i2c_read_byte(0x17, &value);  //get tx los
		status.tx_los = (value & 0x0F);
	}

	if(intr_mask & PORT_INTR_TX_LOL)
	{
		_aoc_101_txcdr_m37145_i2c_read_byte(0x17, &value);  //get tx lol
		status.tx_lol = (value & 0xF0) >> 4;
	}

	if(intr_mask & PORT_INTR_RX_LOS)
	{
		_aoc_101_rxcdr_m37144_i2c_read_byte(0x17, &value);  //get rx los
		status.rx_los = REVERSE_LSB_4BITS(value & 0x0F);
	}

	if(intr_mask & PORT_INTR_RX_LOL)
	{
		_aoc_101_rxcdr_m37144_i2c_read_byte(0x17, &value);  //get rx lol
		status.rx_lol = REVERSE_LSB_4BITS(((value & 0xF0) >> 4));
	}
	return &status;
}

//MSA Lower Page byte86 for tx disable
void AOC_101_set_tx_enable(uint8_t enale)
{
	uint8_t value = 0;

	_aoc_101_txcdr_m37145_i2c_read_byte(0x41,&value);

	value = CLEAR_LSB_4BITS(value)|CLEAR_MSB_4BITS(enale);

	_aoc_101_txcdr_m37145_i2c_write_byte(0x41,value);
	_aoc_101_txcdr_m37145_i2c_read_byte(0x41,&value);
}

//MSA Lower Page byte93 for power override
void  AOC_101_set_low_power(uint8_t enable)
{
	if(enable)
	{
		IT01CF &= ~IT01CF_IN0PL__ACTIVE_HIGH;
		TX_DIS   = 1;  //close txcdr inder
		TX3V3_EN = 1;  //close tx3v3 in order to realize low power mode
		SDA_M = 0;
		SCL_M = 0;
	}
	else
	{
		MSA_set_low_power_mode(1);
		IT01CF |= IT01CF_IN0PL__ACTIVE_HIGH;
		TX_DIS   = 0;  //open txcdr inder
		TX3V3_EN = 0; //open tx3v3 in order to realize high power mode
		SDA_M = 1;
		SCL_M = 1;
	}
}

//MSA Lower Page byte98 for tx and rx cdr control
void AOC_101_set_cdr_control(uint8_t value)
{
	uint8_t tx_cdr_control = 0, rx_cdr_control = 0, tmp = 0;

	tx_cdr_control = ((~value) & 0xF0) >> 4;
	rx_cdr_control = ((~value) & 0x0F);

	rx_cdr_control = REVERSE_LSB_4BITS(rx_cdr_control);

	_aoc_101_txcdr_m37145_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_LSB_4BITS(tmp)| tx_cdr_control;
	_aoc_101_txcdr_m37145_i2c_write_byte(0x10, tmp);  //set tx cdr control

	_aoc_101_rxcdr_m37144_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_LSB_4BITS(tmp)| rx_cdr_control;
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x10, tmp);  //set rx cdr control
}

//MSA Page3 byte234 and byte235 for tx eq
void AOC_101_set_tx_eq(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x25, 0x26,0x27,0x28};
	uint8_t tx_eq[] = {0x0, 0x0, 0x1, 0x2, 0x3, 0x4, 0x7 ,0x8, 0xa, 0xb, 0xd};
	uint8_t tmp = 0;

	if(value > TX_EQ_MAX_VALID)
	{
		return;
	}

	if(value == 0xFF)  //indicates there is not adaptive mode
	{
		tx_eq[value] = 0x6;
	}

	_aoc_101_txcdr_m37145_i2c_read_byte(reg_addr[channel], &tmp);

	value = (CLEAR_LSB_4BITS(tmp) | tx_eq[value]);

	_aoc_101_txcdr_m37145_i2c_write_byte(reg_addr[channel], value);
}

//MSA Page3 byte236 and byte237 for rx emphasis
void AOC_101_set_rx_emphasis(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x46, 0x46,0x47,0x47};
	uint8_t rx_emphasis[] = {0x0, 0x3, 0x5, 0x7,0x9, 0xb, 0xd, 0xf};
	uint8_t tmp = 0;

	if(value > RX_EMPHASIS_MAX_VALID)
	{
		return ;
	}

	//rx channel reverse, rxcdr pin is inverted sequence with qsfp28 pin
	channel = 3 - channel;

	_aoc_101_rxcdr_m37144_i2c_read_byte(reg_addr[channel], &tmp);

	if(channel == 0x0 || channel == 0x2)
	{
		value = CLEAR_LSB_4BITS(tmp) | rx_emphasis[value];
	}
	else if(channel == 0x1 || channel == 0x3)
	{
		value = CLEAR_MSB_4BITS(tmp) | (rx_emphasis[value] << 4);
	}

	_aoc_101_rxcdr_m37144_i2c_write_byte(reg_addr[channel], value);//rxcdr pin is inverted sequence with qsfp28 pin
}

//MSA Page3 byte238 and byte239 rx amplitude
//0x3 900  --0x3c
//0x2 600  --0x1e
//0x1 450  --0x0f
//0x0 250  --0x00
void AOC_101_set_rx_amplitude(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x42,0x43,0x44,0x45};
	uint8_t rx_amplitude[] = {0x00, 0x0f, 0x1e, 0x3c};
	uint8_t tmp = 0;

