paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_aoc_101_drv.c
	if(value > RX_AMPLITUDE_MAX_VALID)
	{
		return;
	}

	//rx channel reverse
	channel = 3 - channel;

	_aoc_101_rxcdr_m37144_i2c_read_byte(reg_addr[channel], &tmp);//rxcdr pin is inverted sequence with qsfp28 pin

	value = (tmp & 0xC0) | rx_amplitude[value];

	_aoc_101_rxcdr_m37144_i2c_write_byte(reg_addr[channel], value);
}


//MSA Page3 byte240 sq disable
void AOC_101_set_cdr_sq_disable(uint8_t value)
{
	uint8_t tx_sq = 0, rx_sq = 0, tmp = 0;

	rx_sq = (value & 0xF0) >> 4;
	tx_sq  = (value & 0x0F);
	rx_sq = REVERSE_LSB_4BITS(rx_sq);

	_aoc_101_txcdr_m37145_i2c_read_byte(0x40,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (tx_sq << 4);
	_aoc_101_txcdr_m37145_i2c_write_byte(0x40, tmp);  //set tx cdr control

	_aoc_101_rxcdr_m37144_i2c_read_byte(0x40,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_sq << 4);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x40, tmp);  //set rx cdr control
}


//MSA Page3 byte241 for rx output disable
void AOC_101_set_rx_output_disable(uint8_t value)
{
	uint8_t rx_output_disable = 0,  tmp = 0;

	rx_output_disable = (value & 0xF0) >> 4;
	rx_output_disable = REVERSE_LSB_4BITS(rx_output_disable);

	_aoc_101_rxcdr_m37144_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_output_disable << 4);
	_aoc_101_rxcdr_m37144_i2c_write_byte(0x10, tmp);
}

//MSA Page3 byte241 for tx adapt eq
void AOC_101_set_tx_adapt_eq(uint8_t value1, uint8_t value2, uint8_t value3)
{
	uint8_t channel = 0, tmp = 0, tx_adapt_eq = 0, i = 0;
	uint8_t reg_addr[] = {0x25,0x26,0x27,0x28};

	tx_adapt_eq = (value1 & 0x0F);

	for(channel = 0; channel < MSA_CHANNEL_NUM; channel ++)
	{
		if(GET_BIT(tx_adapt_eq, channel) == 0x1)
		{
			_aoc_101_txcdr_m37145_i2c_read_byte(reg_addr[channel],&tmp);
			tmp = CLEAR_LSB_4BITS(tmp)| (0x6);
			_aoc_101_txcdr_m37145_i2c_write_byte(reg_addr[channel], tmp);
		}
		else
		{
			if(channel >= 0x0 && channel < 0x2)
			{
				AOC_101_set_tx_eq(channel,(value2 >> (4 * ((channel + 1) % 2)))& 0x0f);
			}
			else if(channel >= 0x2 && channel < MSA_CHANNEL_NUM)
			{
				AOC_101_set_tx_eq(channel,(value3 >> (4 * ((channel + 1) % 2)))& 0x0f);
			}

		}
	}
}

#endif

